# --- Taps ---
tap "homebrew/cask-fonts"       # for JetBrains Mono
tap "nikitabobko/tap"           # AeroSpace WM
tap "felixkratz/formulae"       # Borders for AeroSpace

# --- Core essentials ---
brew "chezmoi"
brew "git"
brew "gh"
brew "neovim"
brew "tmux"
brew "zsh"
brew "zsh-autocomplete"
brew "powerlevel10k"
brew "fzf"
brew "ripgrep"
brew "python@3.12"
brew "go"

# --- Build toolchain (useful for plugins/compilation) ---
brew "gcc"
brew "cmake"
brew "autoconf"
brew "automake"
brew "libtool"
brew "pkgconf"
brew "meson"

# --- Nice-to-haves ---
brew "bitwarden-cli"
brew "wget"
brew "yt-dlp"
brew "htop"

# --- AeroSpace & dependencies ---
brew "felixkratz/formulae/borders"
cask "nikitabobko/tap/aerospace"

# --- Fonts & terminals ---
cask "font-jetbrains-mono"
cask "ghostty"

